app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
	def index
  		@task = Task.new
  		@tasks = Task.all

INSERT INTO "tasks" ("task", "created_at", "updated_at") VALUES (?, ?, ?)  [["task", "asdasd"], ["created_at", "2016-03-05 16:28:40.924490"], ["updated_at", "2016-03-05 16:28:40.924490"]]
---
	def create
		Task.create task_params

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@task = Task.find params.require(:id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "task" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["task", "Go to the store 2"], ["updated_at", "2016-03-05 19:36:40.839023"], ["id", 1]]
---
		task = Task.find params.require(:id)
		if task.update_attributes params.require(:task).permit(:task)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
	def destroy
		Task.destroy params.require(:id)